:PROPERTIES:
:ID:       d63526f2-db09-4c79-8a1a-57d6a7d82ec9
:END:
#+title: 类
#+filetags: cpp

* Footnotes

[fn:1]
#+name: 用一个成员变量 初始化 另一个成员变量
#+begin_src cpp :results output :namespaces std :includes <iostream>
struct Bad {
    int m_bad1 { m_data }; // FIXME 未定义行为: m_bad1 在 m_data 之前初始化
    int m_bad2 { fcn() };  // FIXME 未定义行为: m_bad2 在 m_data 之前初始化（通过 fcn()）
    int m_data { 5 };
    int fcn() { return m_data; }
};
#+end_src

[fn:2]
#+begin_src cpp :results output :namespaces std :includes <iostream>
struct Something {
    void print() {
        std::cout << "non-const\n";
    }

    void print() const {
        std::cout << "const\n";
    }

    void print(int i) {
      cout << "int\n";
    }

    // void mod() const
    // {
    //    ++member;
    // }

    void print2() const {
      cout << "非const对象调用const成员函数\n";
    }

    int member {};
};

int main() {
    Something s1{};
    s1.print();  // const成员函数 重载：calls print()
    s1.print(1); // 非const对象 调用 非const成员函数
    s1.print2(); // 非const对象 调用   const成员函数

    const Something s2{};
    s2.print(); // const成员函数 重载：calls print() const

    // s2.print(1); FIXME const对象 不能调用 非const成员函数
    // s2.mod();    FIXME const对象 不能修改 成员变量
}
#+end_src

#+RESULTS:
: non-const
: int
: 非const对象调用const成员函数
: const

[fn:3]
#+name: static
#+begin_src cpp :results output :namespaces std :includes <iostream>
class A {
  static int a; // 全局数据区，不占类大小
  int c;        // 4字节
  int i;        // 4字节
};

int main() {
  cout << sizeof(A) << '\n';
}
#+end_src

#+RESULTS:
: 8

[fn:4]
#+name: 虚函数
#+begin_src cpp :results output :namespaces std :includes <iostream>
class A
{
  // VirtualTable* __vptr;           // 8字节（虚函数表指针）
  int x;                             // 4字节 -> 4 + 4
  virtual void f() {}
};

int main() {
  cout << sizeof(A) << '\n';
}
#+end_src

#+RESULTS: 虚函数
: 16

[fn:5]
#+name: 虚继承
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Base
{
  double a;          // 8字节
};

class Derived : virtual public Base // g++ 为24；MSVC 为36
{
  // vbptr           // 8字节（虚基类指针）
  int b;             // 4字节 -> 4 + 4
  // double a;       // 8字节（继承来的成员变量）
  // NOTE 通过虚基类指针找到对应的虚基类表，虚基类表中存储了偏移量，通过偏移量找到最基类的成员变量
  // NOTE 示例：A，BC虚继承A，D直接继承BC
  // B、C、D都有各自的 虚基类指针、虚基类表；创建D对象时，由D负责直接初始化A，访问A中成员变量时，D -> 虚基类指针 -> 虚基类表 -> 偏移量 -> 访问成功

  // class base      // 8字节（MSVC的特殊机制：父类内存大小的缓存空间）
};

int main() {
  cout << sizeof(Derived) << '\n';
}
#+end_src

#+RESULTS: 虚继承
: 24

[fn:6]
#+name: 内存对齐
#+begin_src cpp :results output :namespaces std :includes <iostream>
struct A          // A总大小填充为 8的倍数 -> 16
{
    short a {};   // 2字节 -> 2 + 2
    int b {};     // 4字节
    double c {};  // 8字节
};

class B           // B总大小填充为 8的倍数 -> 24
{
  char a;         // 1字节 -> 1 + 7
  double b;       // 8字节
  int c;          // 4字节 -> 4 + 4
};

class C           // C总大小填充为 8的倍数 -> 16
{
  double b;       // 8字节
  char a;         // 1字节 -> 1 + 3
  int c;          // 4字节 ->
};
#+end_src

[fn:7]
#+name: 空类大小
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Empty {}; // 1字节：用于区分空类对象（cpp标准要求每个对象独立唯一的内存地址；若空类大小为0字节，多个空类实例就无法拥有不同地址）

int main() {
  cout << sizeof(Empty) << '\n';
}
#+end_src

#+RESULTS: 空类大小
: 1

[fn:8]
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Accumulator {
private:
    int m_value { 0 };

public:
    void add(int value) { m_value += value; }

    // 友元声明：全局函数 print() 是 Accumulator的友元
    friend void print(const Accumulator& accumulator);
};

// NOTE 类外定义 非成员友元函数
void print(const Accumulator& accumulator) {
    // print() 是 Accumulator的友元，可访问 其 private、protected 成员
    std::cout << accumulator.m_value;
}

int main() {
    Accumulator acc{};
    acc.add(5);
    print(acc);
}
#+end_src

[fn:9]
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Accumulator {
private:
    int m_value { 0 };
public:
    void add(int value) { m_value += value; }

    // NOTE 定义在类内的 友元函数 是非成员函数！
    friend void print(const Accumulator& accumulator) {
        // Because print() is a friend of Accumulator
        // it can access the private members of Accumulator
        std::cout << accumulator.m_value;
    }
};

int main() {
    Accumulator acc{};
    acc.add(5);
    print(acc); // NOTE 是非成员函数，因此这样使用，而不是 acc.print 的形式
}
#+end_src

#+RESULTS:
: 5

[fn:10]
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Storage {
private:
    int m_nValue {};
    double m_dValue {};
public:
    Storage(int nValue, double dValue) : m_nValue { nValue }, m_dValue { dValue } { }
    // NOTE 声明 Display类 是 Storage类的朋友
    friend class Display;
};

class Display {
private:
    bool m_displayIntFirst {};

public:
    Display(bool displayIntFirst) : m_displayIntFirst { displayIntFirst } { }

    // Display 是 Storage 的朋友, Display成员 可以访问 Storage 的 private成员
    void displayStorage(const Storage& storage) {
        if (m_displayIntFirst)
            std::cout << storage.m_nValue << ' ' << storage.m_dValue << '\n';
        else
            std::cout << storage.m_dValue << ' ' << storage.m_nValue << '\n';
    }

    void setDisplayIntFirst(bool b) {
         m_displayIntFirst = b;
    }
};

int main() {
    Storage storage { 5, 6.7 };
    Display display { false };

    display.displayStorage(storage);

    display.setDisplayIntFirst(true);
    display.displayStorage(storage);
}
#+end_src

#+RESULTS:
: 6.7 5
: 5 6.7
